{
  "modelTopology": "{\"class_name\":\"Sequential\",\"config\":{\"name\":\"sequential_1\",\"layers\":[{\"class_name\":\"Dense\",\"config\":{\"units\":64,\"activation\":\"relu\",\"use_bias\":true,\"kernel_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":1,\"mode\":\"fan_avg\",\"distribution\":\"normal\",\"seed\":null}},\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"kernel_regularizer\":null,\"bias_regularizer\":null,\"activity_regularizer\":null,\"kernel_constraint\":null,\"bias_constraint\":null,\"name\":\"dense_Dense1\",\"trainable\":true,\"batch_input_shape\":[null,13],\"dtype\":\"float32\"}},{\"class_name\":\"Dropout\",\"config\":{\"rate\":0.2,\"noise_shape\":null,\"seed\":null,\"name\":\"dropout_Dropout1\",\"trainable\":true}},{\"class_name\":\"Dense\",\"config\":{\"units\":32,\"activation\":\"relu\",\"use_bias\":true,\"kernel_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":1,\"mode\":\"fan_avg\",\"distribution\":\"normal\",\"seed\":null}},\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"kernel_regularizer\":null,\"bias_regularizer\":null,\"activity_regularizer\":null,\"kernel_constraint\":null,\"bias_constraint\":null,\"name\":\"dense_Dense2\",\"trainable\":true}},{\"class_name\":\"Dropout\",\"config\":{\"rate\":0.1,\"noise_shape\":null,\"seed\":null,\"name\":\"dropout_Dropout2\",\"trainable\":true}},{\"class_name\":\"Dense\",\"config\":{\"units\":16,\"activation\":\"relu\",\"use_bias\":true,\"kernel_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":1,\"mode\":\"fan_avg\",\"distribution\":\"normal\",\"seed\":null}},\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"kernel_regularizer\":null,\"bias_regularizer\":null,\"activity_regularizer\":null,\"kernel_constraint\":null,\"bias_constraint\":null,\"name\":\"dense_Dense3\",\"trainable\":true}},{\"class_name\":\"Dense\",\"config\":{\"units\":1,\"activation\":\"linear\",\"use_bias\":true,\"kernel_initializer\":{\"class_name\":\"VarianceScaling\",\"config\":{\"scale\":1,\"mode\":\"fan_avg\",\"distribution\":\"normal\",\"seed\":null}},\"bias_initializer\":{\"class_name\":\"Zeros\",\"config\":{}},\"kernel_regularizer\":null,\"bias_regularizer\":null,\"activity_regularizer\":null,\"kernel_constraint\":null,\"bias_constraint\":null,\"name\":\"dense_Dense4\",\"trainable\":true}}]},\"keras_version\":\"tfjs-layers 4.22.0\",\"backend\":\"tensor_flow.js\"}",
  "weightData": [
    {
      "name": "dense_Dense1/kernel",
      "shape": [
        13,
        64
      ],
      "data": [
        0.04073445871472359,
        0.020906375721096992,
        0.01146217342466116,
        -0.12060989439487457,
        0.00186372350435704,
        -0.15570464730262756,
        -0.02600248157978058,
        -0.009571336209774017,
        0.001626861048862338,
        0.14423102140426636,
        -0.06145510450005531,
        0.10557863861322403,
        -0.0794018805027008,
        0.1051555722951889,
        -0.19711321592330933,
        -0.08487121760845184,
        -0.3132462501525879,
        0.025856951251626015,
        -0.01775665394961834,
        -0.19791240990161896,
        0.1714676171541214,
        0.131639301776886,
        -0.04421137645840645,
        -0.11381232738494873,
        0.06780495494604111,
        0.02507132664322853,
        -0.12464213371276855,
        0.08763676136732101,
        -0.10284355282783508,
        -0.22837932407855988,
        0.11689820140600204,
        -0.20234255492687225,
        0.046158093959093094,
        -0.20486938953399658,
        0.14101354777812958,
        -0.07204457372426987,
        -0.2547825574874878,
        0.013215518556535244,
        0.04135644808411598,
        -0.06305680423974991,
        0.19866696000099182,
        0.12938439846038818,
        -0.15481260418891907,
        -0.028833335265517235,
        -0.07618900388479233,
        0.0030323080718517303,
        0.1915634274482727,
        0.2707170248031616,
        -0.19508641958236694,
        0.035939689725637436,
        -0.09707319736480713,
        -0.17907732725143433,
        -0.2669714093208313,
        0.04072967916727066,
        0.22358638048171997,
        0.045440658926963806,
        0.054429683834314346,
        0.1394265592098236,
        -0.21474161744117737,
        0.10464309900999069,
        -0.07574664056301117,
        0.33775946497917175,
        0.02738093212246895,
        0.03208298608660698,
        0.24130253493785858,
        0.06739524006843567,
        -0.03580120578408241,
        -0.06256794929504395,
        0.05007298290729523,
        0.01773528754711151,
        -0.02123120054602623,
        0.2576849162578583,
        -0.26569920778274536,
        0.11984612792730331,
        -0.03326142951846123,
        -0.07114764302968979,
        -0.09640118479728699,
        0.1887722760438919,
        -0.02653687447309494,
        0.09591212123632431,
        -0.125942662358284,
        -0.011535360477864742,
        -0.05331990122795105,
        -0.19958041608333588,
        -0.2762203812599182,
        0.07205324620008469,
        0.01636497676372528,
        -0.09603425860404968,
        -0.030723975971341133,
        0.07240381091833115,
        0.08858753740787506,
        0.2663222551345825,
        -0.16192856431007385,
        -0.31321650743484497,
        -0.1946776807308197,
        0.17212438583374023,
        -0.19549597799777985,
        -0.04225793480873108,
        -0.1379108875989914,
        -0.0006167261744849384,
        -0.011999436654150486,
        0.21241912245750427,
        0.04428140074014664,
        -0.09240887314081192,
        -0.005071145482361317,
        -0.025987152010202408,
        0.1506168693304062,
        0.0343206487596035,
        -0.1272614300251007,
        -0.110600046813488,
        0.05775895714759827,
        -0.20399309694766998,
        -0.05525517836213112,
        -0.19741396605968475,
        0.07969342172145844,
        0.23410451412200928,
        0.10395604372024536,
        -0.16335706412792206,
        0.20581358671188354,
        0.12758639454841614,
        -0.19647057354450226,
        -0.06214071437716484,
        0.20933404564857483,
        -0.007798505015671253,
        -0.06582701206207275,
        -0.0874379500746727,
        0.09093686938285828,
        -0.012289384379982948,
        0.022293752059340477,
        -0.008260502479970455,
        0.22586749494075775,
        0.05232416093349457,
        -0.15800949931144714,
        0.12689583003520966,
        -0.17470119893550873,
        -0.13292264938354492,
        0.09274835139513016,
        -0.2529313564300537,
        -0.048446185886859894,
        0.15256303548812866,
        0.11932718753814697,
        0.004557190928608179,
        -0.1340729296207428,
        0.10030781477689743,
        0.1395212709903717,
        -0.08176210522651672,
        -0.1096339300274849,
        0.028945812955498695,
        0.24822355806827545,
        0.1548929065465927,
        -0.14319564402103424,
        -0.015730982646346092,
        0.11401884257793427,
        0.15823239088058472,
        0.16718867421150208,
        -0.008084376342594624,
        0.19454774260520935,
        -0.07104344666004181,
        -0.24412879347801208,
        0.13115420937538147,
        -0.1658199578523636,
        -0.03853762522339821,
        0.20410870015621185,
        -0.040430646389722824,
        0.2599855959415436,
        -0.09227168560028076,
        0.038620300590991974,
        0.01715962588787079,
        -0.13718341290950775,
        0.16810423135757446,
        -0.10024373233318329,
        -0.0394829586148262,
        -0.03391871973872185,
        -0.15637655556201935,
        0.20305143296718597,
        0.14064866304397583,
        0.20682242512702942,
        0.07811755686998367,
        0.2404603809118271,
        -0.013141757808625698,
        -0.1589914709329605,
        -0.21237404644489288,
        0.1762852817773819,
        0.11830293387174606,
        -0.025242138653993607,
        0.06152685731649399,
        0.0196832288056612,
        0.00841731857508421,
        -0.0597468800842762,
        0.23203374445438385,
        -0.1585020124912262,
        0.08165334165096283,
        -0.12851697206497192,
        0.22075164318084717,
        0.11487454921007156,
        -0.04191197082400322,
        -0.14768539369106293,
        -0.19296690821647644,
        0.0492580272257328,
        -0.05412894859910011,
        0.27670595049858093,
        -0.15107880532741547,
        -0.07632206380367279,
        -0.24429656565189362,
        0.15275099873542786,
        0.18809378147125244,
        0.07804243266582489,
        0.03307870030403137,
        0.008695454336702824,
        0.1538117378950119,
        -0.10745248943567276,
        -0.1366310864686966,
        0.01444395724684,
        -0.06372951716184616,
        -0.06168258190155029,
        -0.09473950415849686,
        -0.15753036737442017,
        0.26692989468574524,
        -0.15703929960727692,
        -0.06682238727807999,
        0.22019478678703308,
        -0.09620317071676254,
        -0.016129380092024803,
        0.09076046943664551,
        -0.15819835662841797,
        0.07364556938409805,
        0.0035511921159923077,
        -0.07708892971277237,
        -0.03571920841932297,
        0.10684610158205032,
        -0.23364049196243286,
        0.10484125465154648,
        -0.05389150232076645,
        0.057328738272190094,
        0.14661793410778046,
        -0.15371660888195038,
        0.03717862442135811,
        -0.07876250147819519,
        0.22268587350845337,
        0.1926020234823227,
        -0.1823885142803192,
        0.01564864255487919,
        0.026826689019799232,
        -0.10576360672712326,
        0.040280476212501526,
        0.06514693796634674,
        0.19819332659244537,
        -0.20875698328018188,
        0.21049699187278748,
        -0.16075798869132996,
        -0.11591983586549759,
        -0.31076565384864807,
        0.09877903014421463,
        0.20702742040157318,
        -0.09197917580604553,
        -0.05317632853984833,
        -0.15159279108047485,
        -0.05229178071022034,
        -0.022618496790528297,
        -0.02497098222374916,
        -0.1643616259098053,
        -0.016663698479533195,
        -0.15677639842033386,
        0.00047844689106568694,
        -0.017200471833348274,
        -0.07079865038394928,
        0.036322176456451416,
        -0.003562919097021222,
        -0.08242148905992508,
        -0.020284106954932213,
        -0.0592118464410305,
        -0.027712762355804443,
        -0.15653468668460846,
        0.16899146139621735,
        -0.14143766462802887,
        -0.2336815595626831,
        -0.00673691974952817,
        0.14155946671962738,
        -0.0767122134566307,
        -0.051192693412303925,
        -0.009042910300195217,
        -0.2691742479801178,
        0.006075453478842974,
        -0.007104692980647087,
        0.019278641790151596,
        0.12126856297254562,
        0.20830942690372467,
        0.01520590391010046,
        -0.19148287177085876,
        -0.18613877892494202,
        -0.08417366445064545,
        -0.20369473099708557,
        0.14437416195869446,
        0.23956255614757538,
        -0.14390142261981964,
        -0.21539390087127686,
        0.15785187482833862,
        0.059229809790849686,
        -0.01158132590353489,
        0.09667837619781494,
        -0.08514103293418884,
        -0.16764254868030548,
        0.05983458459377289,
        0.1669071912765503,
        -0.019190801307559013,
        0.21343177556991577,
        0.06816080957651138,
        -0.09802957624197006,
        -0.23863285779953003,
        0.058670513331890106,
        -0.05709422007203102,
        0.05459398031234741,
        0.2579316794872284,
        0.03506315499544144,
        0.02230779081583023,
        -0.17986813187599182,
        -0.1025347113609314,
        0.03162728250026703,
        0.09158524870872498,
        -0.12279200553894043,
        0.001274698181077838,
        -0.11611687391996384,
        0.21933986246585846,
        0.08062376081943512,
        0.012687791138887405,
        -0.04618194326758385,
        -0.03959166631102562,
        -0.009494851343333721,
        -0.19089804589748383,
        -0.14819668233394623,
        -0.04902977496385574,
        0.24260330200195312,
        -0.27550944685935974,
        -0.02144239842891693,
        -0.02165832556784153,
        0.30385684967041016,
        0.052726585417985916,
        -0.0943671464920044,
        0.18831847608089447,
        0.22253316640853882,
        -0.022727500647306442,
        -0.10457422584295273,
        0.09899774938821793,
        0.16530457139015198,
        -0.0532124862074852,
        0.15720880031585693,
        0.008149499073624611,
        0.26676201820373535,
        0.012391559779644012,
        0.023900995030999184,
        -0.01767631806433201,
        0.21110673248767853,
        -0.24511907994747162,
        0.06805960088968277,
        -0.0414699912071228,
        0.18742065131664276,
        -0.22742602229118347,
        0.0597977340221405,
        0.02409723773598671,
        0.12684787809848785,
        -0.1521592140197754,
        -0.10565026849508286,
        0.10605471581220627,
        -0.11441721022129059,
        0.09073638170957565,
        0.04548226296901703,
        0.023084517568349838,
        0.08082975447177887,
        -0.11583901196718216,
        0.11856776475906372,
        -0.10944020748138428,
        0.2170889973640442,
        -0.2928255498409271,
        -0.05459988862276077,
        0.020482100546360016,
        0.11033671349287033,
        0.0582527257502079,
        -0.1595233827829361,
        -0.20719395577907562,
        0.04077727720141411,
        -0.18112815916538239,
        -0.2087259143590927,
        -0.07505524903535843,
        -0.06719263643026352,
        0.08271757513284683,
        -0.1561267077922821,
        0.07023320347070694,
        0.037467703223228455,
        -0.12072650343179703,
        0.0888734757900238,
        0.11237369477748871,
        0.08910319209098816,
        -0.09815658628940582,
        0.0355914831161499,
        -0.2651694715023041,
        0.07372689247131348,
        0.06902139633893967,
        -0.21732506155967712,
        0.07011719048023224,
        -0.09675171226263046,
        0.07706210017204285,
        -0.3037184178829193,
        -0.1107441857457161,
        -0.2975548505783081,
        -0.11126234382390976,
        0.0781133845448494,
        0.07483541965484619,
        -0.044913630932569504,
        0.08304711431264877,
        0.1804279237985611,
        -0.17458990216255188,
        0.08701682090759277,
        -0.18646854162216187,
        -0.15162181854248047,
        -0.01965143345296383,
        0.06989488005638123,
        0.12615592777729034,
        0.0622762106359005,
        -0.119572214782238,
        0.10210587084293365,
        -0.18333911895751953,
        0.1555332988500595,
        0.009215092286467552,
        -0.22314563393592834,
        0.11453720927238464,
        -0.0572882816195488,
        0.029547182843089104,
        0.008367531932890415,
        0.00830171536654234,
        0.2642759382724762,
        -0.12681326270103455,
        0.12474633008241653,
        0.198900043964386,
        0.0968397855758667,
        -0.27892830967903137,
        0.15365855395793915,
        0.047126658260822296,
        -0.07267556339502335,
        -0.17068429291248322,
        -0.26405131816864014,
        -0.060746826231479645,
        -0.145811066031456,
        -0.21366722881793976,
        -0.07496316730976105,
        0.30462995171546936,
        -0.04711972177028656,
        -0.11543785035610199,
        -0.14228108525276184,
        -0.15952922403812408,
        -0.0638832077383995,
        -0.10315000265836716,
        0.24760763347148895,
        0.00942966714501381,
        -0.16305573284626007,
        0.019441409036517143,
        0.07825395464897156,
        0.07335302233695984,
        0.013731495477259159,
        -0.06588380038738251,
        -0.02954660728573799,
        0.14856332540512085,
        -0.1337607353925705,
        -0.036710090935230255,
        0.23479236662387848,
        -0.0603836253285408,
        -0.13196557760238647,
        0.005035028327256441,
        0.15224523842334747,
        0.14687156677246094,
        0.2551749050617218,
        0.006934376433491707,
        -0.24345877766609192,
        0.2558877468109131,
        -0.052973248064517975,
        -0.2762358486652374,
        -0.15718704462051392,
        -0.018012458458542824,
        0.002957169432193041,
        -0.06186775490641594,
        0.24621756374835968,
        0.22647424042224884,
        0.00848287995904684,
        -0.0035212815273553133,
        0.0794973373413086,
        0.16092969477176666,
        0.13418453931808472,
        -0.16152025759220123,
        -0.15812505781650543,
        -0.26561298966407776,
        0.001558177755214274,
        0.2671608328819275,
        0.2644234299659729,
        0.2757719159126282,
        -0.10794169455766678,
        0.15721970796585083,
        -0.1694306582212448,
        0.05784215033054352,
        0.2289605587720871,
        -0.13442663848400116,
        0.13068002462387085,
        -0.02539806254208088,
        0.06027872860431671,
        -0.2948845624923706,
        0.139823317527771,
        -0.04279472678899765,
        0.08067229390144348,
        -0.08754638582468033,
        0.1562252789735794,
        0.25564664602279663,
        -0.040097061544656754,
        0.19791404902935028,
        -0.06520586460828781,
        0.08652912080287933,
        0.08339215815067291,
        0.018857808783650398,
        -0.2913109064102173,
        -0.09833260625600815,
        -0.13697360455989838,
        0.22717872262001038,
        -0.14825840294361115,
        -0.07484985888004303,
        -0.03659540042281151,
        0.02908862754702568,
        0.22760261595249176,
        0.06716704368591309,
        -0.07879878580570221,
        0.18611016869544983,
        -0.2117217779159546,
        0.016494059935212135,
        0.004037647508084774,
        -0.03990538418292999,
        0.08242827653884888,
        0.00605941005051136,
        -0.01997736282646656,
        0.15154975652694702,
        0.02548360638320446,
        0.16507838666439056,
        -0.07696855068206787,
        -0.007262424100190401,
        0.2201407551765442,
        -0.05804439261555672,
        -0.19503174722194672,
        -0.08621476590633392,
        0.13379749655723572,
        0.21743452548980713,
        -0.092405304312706,
        -0.06296785920858383,
        -0.24741309881210327,
        -0.1561780422925949,
        -0.1566653549671173,
        -0.019505392760038376,
        0.2176063507795334,
        -0.0836266577243805,
        0.0411684550344944,
        0.0037459474988281727,
        -0.1735672503709793,
        -0.08633783459663391,
        -0.11953356862068176,
        0.09039154648780823,
        0.10568229109048843,
        0.099876768887043,
        -0.045766524970531464,
        0.05696683004498482,
        0.026083525270223618,
        0.20007388293743134,
        0.12041620165109634,
        -0.26236191391944885,
        0.16496112942695618,
        0.08937128633260727,
        -0.07691360265016556,
        -0.0317889042198658,
        -0.2099587768316269,
        -0.18590348958969116,
        0.38671159744262695,
        0.0705116018652916,
        -0.28816643357276917,
        0.08732844144105911,
        0.19822029769420624,
        -0.08384548127651215,
        -0.20175378024578094,
        -0.05605785921216011,
        -0.01897336170077324,
        -0.008029467426240444,
        -0.2097557783126831,
        0.2428044080734253,
        -0.10844963043928146,
        0.00440227473154664,
        0.22244800627231598,
        -0.22763586044311523,
        -0.03238065540790558,
        -0.17162871360778809,
        -0.29831162095069885,
        0.1491534560918808,
        -0.1857147514820099,
        0.09286883473396301,
        0.08908340334892273,
        0.2903519570827484,
        -0.16658051311969757,
        0.14855170249938965,
        0.010571698658168316,
        0.19276931881904602,
        0.07942771911621094,
        -0.1941860169172287,
        0.01998305507004261,
        0.024355454370379448,
        -0.2616797089576721,
        -0.1415531039237976,
        -0.1894790381193161,
        -0.04719969630241394,
        -0.2039519101381302,
        0.15518873929977417,
        -0.037029534578323364,
        -0.022138774394989014,
        -0.11574098467826843,
        0.10607432574033737,
        0.12362580001354218,
        -0.21642959117889404,
        -0.0464649461209774,
        -0.19735541939735413,
        -0.08380007743835449,
        0.05654533952474594,
        -0.008892102167010307,
        -0.07495827972888947,
        0.21520204842090607,
        -0.21515487134456635,
        -0.16729676723480225,
        0.036417387425899506,
        -0.058490775525569916,
        -0.021858664229512215,
        0.004034724086523056,
        -0.02065769024193287,
        -0.11863572895526886,
        -0.16682536900043488,
        0.00347995781339705,
        -0.17006133496761322,
        0.0076959081925451756,
        -0.07690446078777313,
        0.06751253455877304,
        -0.004921391140669584,
        0.008349156007170677,
        -0.05659465491771698,
        0.02621736377477646,
        -0.17419682443141937,
        0.1988634467124939,
        0.1463436335325241,
        -0.04328053072094917,
        0.010459673590958118,
        -0.0979677215218544,
        0.020574547350406647,
        -0.06059008464217186,
        0.19069868326187134,
        0.010600156150758266,
        0.2974627614021301,
        -0.027530670166015625,
        -0.31279638409614563,
        -0.2905826270580292,
        0.12727470695972443,
        -0.28400087356567383,
        0.11847635358572006,
        0.16358143091201782,
        -0.18994681537151337,
        0.07703344523906708,
        -0.009488441981375217,
        -0.006501420866698027,
        -0.03878869488835335,
        0.2389715015888214,
        -0.16881071031093597,
        -0.007509786169975996,
        -0.07943379133939743,
        -0.11043117195367813,
        0.17572568356990814,
        0.19441917538642883,
        -0.04357675835490227,
        0.038823202252388,
        -0.13527661561965942,
        -0.05318015068769455,
        -0.04543127864599228,
        0.10639531910419464,
        0.24606218934059143,
        -0.1607506275177002,
        0.2030041515827179,
        0.24197140336036682,
        -0.021754737943410873,
        0.0843668207526207,
        -0.028115568682551384,
        0.007392140571027994,
        0.04318302869796753,
        0.24918487668037415,
        0.042839378118515015,
        -0.12079883366823196,
        0.1753515750169754,
        0.14179252088069916,
        0.061685383319854736,
        -0.007210415322333574,
        -0.100086510181427,
        0.2428942322731018,
        0.14509743452072144,
        0.1765461415052414,
        -0.13321523368358612,
        0.03666234761476517,
        -0.2712153196334839,
        -0.04257754981517792,
        0.13321810960769653,
        0.07197660207748413,
        0.0338500514626503,
        -0.1294213980436325,
        -0.162277951836586,
        0.0857725441455841,
        -0.2098134607076645,
        -0.0843164473772049,
        -0.10727415233850479,
        -0.07787300646305084,
        0.10466175526380539,
        -0.3046327829360962,
        0.09060953557491302,
        -0.16156059503555298,
        -0.005537216551601887,
        0.19249296188354492,
        0.1376185268163681,
        0.06181112304329872,
        0.14930176734924316,
        -0.045868922024965286,
        -0.16637171804904938,
        0.008557194843888283,
        -0.24033187329769135,
        0.06950754672288895,
        -0.03240111842751503,
        0.11209294199943542,
        0.044042665511369705,
        0.14690130949020386,
        -0.05362482741475105,
        -0.05849418416619301,
        0.018151013180613518,
        0.22756992280483246,
        0.11632660031318665,
        0.27319425344467163,
        -0.21379631757736206,
        0.22031961381435394,
        -0.0798567458987236,
        -0.05122195929288864,
        -0.24255643784999847,
        -0.012699482031166553,
        -0.09560128301382065,
        0.12080210447311401,
        0.09713104367256165,
        0.2713237404823303,
        -0.036253921687603,
        -0.17335925996303558,
        0.28486818075180054,
        -0.06741776317358017,
        0.1520145833492279,
        -0.06498796492815018,
        0.09659301489591599,
        -0.1707455962896347,
        0.22133515775203705,
        0.06349296122789383,
        0.15738117694854736,
        -0.05919389799237251,
        -0.041212692856788635,
        0.1670924425125122,
        0.21974195539951324,
        0.027813127264380455,
        -0.11652123928070068,
        -0.038985468447208405,
        -0.19647791981697083,
        0.03134380280971527,
        0.2803646922111511,
        0.045994918793439865,
        0.22539205849170685,
        0.1365395039319992,
        -0.11426200717687607,
        0.06167043372988701,
        -0.003277776762843132,
        -0.029727831482887268,
        0.10494484752416611,
        -0.13433434069156647,
        -0.16603633761405945,
        0.0689677745103836,
        -0.03974178805947304,
        0.14059540629386902,
        -0.027778908610343933,
        -0.023734411224722862,
        -0.024865036830306053,
        -0.222906693816185,
        -0.06869937479496002,
        -0.136244535446167,
        -0.21922655403614044,
        0.1658986508846283,
        -0.23596125841140747,
        -0.10003263503313065,
        0.0725945308804512,
        -0.1504383236169815,
        0.058074112981557846,
        0.09852474927902222,
        -0.0725143551826477,
        -0.08532190322875977,
        -0.062420520931482315,
        -0.008403725922107697,
        0.04820176586508751,
        0.05441088229417801,
        0.03879481926560402,
        0.08633919060230255,
        0.10909949243068695,
        0.21199092268943787,
        -0.07613740116357803,
        0.03667194023728371,
        -0.029795300215482712,
        0.08046550303697586,
        -0.3060474097728729,
        0.247171550989151,
        0.02186908759176731,
        -0.2881002128124237,
        -0.15985170006752014,
        0.17249810695648193,
        0.19670970737934113,
        0.01926228031516075,
        0.07623095065355301,
        -0.09650016576051712,
        0.0932130217552185,
        0.11254747956991196,
        -0.04656985402107239,
        0.14235179126262665,
        0.20649772882461548,
        -0.14254525303840637,
        -0.20555418729782104,
        0.07219447940587997,
        0.14270980656147003,
        -0.27655214071273804,
        0.213515505194664,
        0.056445345282554626,
        0.057612188160419464,
        -0.03359165042638779
      ]
    },
    {
      "name": "dense_Dense1/bias",
      "shape": [
        64
      ],
      "data": [
        -0.028454454615712166,
        -0.020121630281209946,
        0.0036318409256637096,
        -0.03465978056192398,
        -0.003984466195106506,
        -0.011599850840866566,
        0.025695331394672394,
        -0.044524185359478,
        -0.004936111159622669,
        0.006199678871780634,
        -0.031982630491256714,
        0.0033963604364544153,
        0.019813790917396545,
        -0.03801504150032997,
        0.004666738212108612,
        -0.0025906143710017204,
        -0.0408722348511219,
        0.013352878391742706,
        -0.007156025152653456,
        0.006644326262176037,
        -0.013336517848074436,
        0.02854837477207184,
        -0.03263634815812111,
        -0.004838226828724146,
        0.0010196281364187598,
        0.03010084293782711,
        0.030111532658338547,
        0.03885437175631523,
        -0.004186777863651514,
        0.015376616269350052,
        -0.04453582316637039,
        -0.0379357747733593,
        -0.02144477888941765,
        -0.026316864416003227,
        -0.010842690244317055,
        -0.024051407352089882,
        -0.012308948673307896,
        -0.019065789878368378,
        -0.033595021814107895,
        0.002459350973367691,
        -0.05707965046167374,
        -0.034890301525592804,
        -0.0038889446295797825,
        -0.021775919944047928,
        -0.007917127572000027,
        -0.024851275607943535,
        -0.0654570534825325,
        0.033790070563554764,
        0.04519195482134819,
        -0.0107686473056674,
        -0.025222700089216232,
        -0.00004731542503577657,
        -0.02236284874379635,
        -0.05182545259594917,
        -0.02755120024085045,
        -0.018793383613228798,
        -0.017078004777431488,
        -0.05181866139173508,
        -0.003039261791855097,
        0.019080545753240585,
        -0.020696284249424934,
        0.006035659462213516,
        -0.000049379217671230435,
        -0.021378109231591225
      ]
    },
    {
      "name": "dense_Dense2/kernel",
      "shape": [
        64,
        32
      ],
      "data": [
        -0.09897353500127792,
        -0.08599378168582916,
        0.021231835708022118,
        -0.18569307029247284,
        0.17796604335308075,
        -0.2386949211359024,
        -0.10379413515329361,
        0.2491888403892517,
        0.006525630597025156,
        0.06345014274120331,
        0.14003123342990875,
        -0.11297564953565598,
        -0.015003453008830547,
        0.12722691893577576,
        -0.21037857234477997,
        -0.1386093646287918,
        0.07152724266052246,
        -0.13818354904651642,
        -0.011785541661083698,
        -0.029258960857987404,
        -0.11933675408363342,
        0.1322956681251526,
        -0.032288696616888046,
        -0.11676836013793945,
        -0.06157318502664566,
        0.07178246974945068,
        0.10372135043144226,
        0.06634658575057983,
        -0.038027677685022354,
        -0.15526355803012848,
        0.16853128373622894,
        -0.013857463374733925,
        -0.023008184507489204,
        0.09110699594020844,
        0.05241461843252182,
        -0.11917959898710251,
        -0.10252868384122849,
        0.02737542800605297,
        0.012859675101935863,
        0.07568921148777008,
        0.1160803958773613,
        -0.19452233612537384,
        -0.04884253814816475,
        -0.0027886333409696817,
        0.009270325303077698,
        0.03229821100831032,
        0.033578332513570786,
        -0.16673584282398224,
        0.06791853904724121,
        -0.022031597793102264,
        0.06434931606054306,
        -0.08120454847812653,
        -0.23847123980522156,
        -0.014789819717407227,
        -0.15989795327186584,
        0.1560695767402649,
        0.03343387693166733,
        0.2221442461013794,
        -0.08242926746606827,
        0.0023042496759444475,
        -0.01572488062083721,
        -0.13591928780078888,
        -0.004006266128271818,
        -0.2344193309545517,
        0.07427264004945755,
        -0.026656029745936394,
        -0.1679607331752777,
        -0.09398090094327927,
        -0.03310404717922211,
        0.10159844905138016,
        -0.10141238570213318,
        0.029480233788490295,
        0.2453673779964447,
        0.05167299136519432,
        -0.0745077133178711,
        -0.12533845007419586,
        -0.09688708931207657,
        0.03778189420700073,
        0.052116621285676956,
        0.14679443836212158,
        -0.015654923394322395,
        0.030062885954976082,
        0.047687191516160965,
        -0.07933088392019272,
        -0.1107533797621727,
        -0.03988916054368019,
        -0.0049372161738574505,
        -0.0346183143556118,
        -0.09759429097175598,
        -0.15628226101398468,
        -0.11231043189764023,
        -0.16693729162216187,
        0.22827333211898804,
        0.1290338635444641,
        -0.03555624559521675,
        -0.18204815685749054,
        -0.02340509556233883,
        0.0550178624689579,
        -0.012390322051942348,
        -0.06653870642185211,
        0.1537247747182846,
        -0.06070762500166893,
        0.11745625734329224,
        0.0015154561260715127,
        -0.03860501945018768,
        0.19884875416755676,
        0.12541326880455017,
        -0.0850963294506073,
        -0.012374691665172577,
        0.02128109149634838,
        0.22398239374160767,
        0.011323750950396061,
        0.1583276391029358,
        -0.23963892459869385,
        0.06633148342370987,
        -0.08030329644680023,
        -0.15468646585941315,
        0.026270294561982155,
        -0.05559758096933365,
        0.11133170872926712,
        -0.20092694461345673,
        0.010912002064287663,
        0.011308672837913036,
        -0.22010013461112976,
        0.02814202755689621,
        -0.1661030650138855,
        0.10960333794355392,
        -0.19694995880126953,
        -0.054814185947179794,
        -0.18381763994693756,
        0.020726608112454414,
        0.04352046549320221,
        0.17630088329315186,
        0.05364132300019264,
        -0.08938796818256378,
        -0.09746065735816956,
        -0.03821473941206932,
        -0.057944707572460175,
        -0.12987454235553741,
        0.00994811486452818,
        0.082489974796772,
        -0.21643149852752686,
        -0.199393168091774,
        -0.056216057389974594,
        -0.21781159937381744,
        -0.06826967746019363,
        0.04492327198386192,
        -0.1399272084236145,
        -0.005883416160941124,
        0.11074637621641159,
        0.24716004729270935,
        -0.06612519174814224,
        0.062373075634241104,
        -0.13316790759563446,
        -0.016744082793593407,
        -0.1312519609928131,
        -0.20303109288215637,
        0.09025740623474121,
        0.01456858403980732,
        0.044793590903282166,
        0.1707884520292282,
        -0.033934593200683594,
        -0.07392838597297668,
        -0.013222415000200272,
        -0.22067749500274658,
        -0.05930924415588379,
        -0.2558327913284302,
        -0.22873958945274353,
        -0.0626273900270462,
        0.07884608954191208,
        0.12792900204658508,
        0.11245512217283249,
        -0.04801668971776962,
        0.18892742693424225,
        -0.10241609066724777,
        0.04331913962960243,
        0.10316035896539688,
        0.15450122952461243,
        0.16653187572956085,
        -0.217035710811615,
        -0.263274610042572,
        0.20375293493270874,
        -0.06296876072883606,
        -0.10868166387081146,
        0.035862963646650314,
        0.15320584177970886,
        -0.2799682319164276,
        -0.25057482719421387,
        0.06136363372206688,
        0.13723105192184448,
        -0.001580572803504765,
        0.19317667186260223,
        0.17856794595718384,
        -0.07134747505187988,
        0.04246247559785843,
        -0.22262534499168396,
        -0.08606249839067459,
        0.05706251785159111,
        0.20829755067825317,
        -0.14776979386806488,
        -0.1022401973605156,
        0.12487415969371796,
        0.16173717379570007,
        0.15817055106163025,
        0.008041869848966599,
        -0.02526325359940529,
        -0.22423511743545532,
        -0.14081916213035583,
        0.23049236834049225,
        -0.29915380477905273,
        -0.10534166544675827,
        -0.1529766470193863,
        0.07003185898065567,
        -0.12230756878852844,
        -0.05210990831255913,
        0.023717572912573814,
        0.11153195798397064,
        -0.2432267665863037,
        -0.053399473428726196,
        0.05588027462363243,
        -0.1462019979953766,
        -0.10240748524665833,
        -0.06707906723022461,
        -0.15364821255207062,
        -0.019296793267130852,
        -0.14921048283576965,
        0.17980052530765533,
        -0.24336102604866028,
        0.010124247521162033,
        0.00470928056165576,
        -0.2081991732120514,
        -0.07148443907499313,
        0.03401752561330795,
        0.10635841637849808,
        0.028829701244831085,
        -0.010940182954072952,
        0.15510301291942596,
        0.10579967498779297,
        -0.07737092673778534,
        0.2009449154138565,
        0.023115340620279312,
        0.025586694478988647,
        -0.1212807446718216,
        0.1431134194135666,
        -0.022919591516256332,
        0.12380323559045792,
        0.07529086619615555,
        0.044560763984918594,
        -0.04688076674938202,
        0.0342562161386013,
        0.14655041694641113,
        0.016851583495736122,
        0.18715326488018036,
        -0.09862003475427628,
        0.05468376353383064,
        0.08031394332647324,
        0.15834906697273254,
        -0.032761331647634506,
        -0.14167463779449463,
        0.09582599252462387,
        0.1477517932653427,
        -0.09273692965507507,
        0.2033509910106659,
        -0.1482951045036316,
        0.16851462423801422,
        -0.18626460433006287,
        0.1082920953631401,
        -0.27752685546875,
        0.12907415628433228,
        0.11859451234340668,
        0.11681011319160461,
        -0.01175008062273264,
        -0.1276482790708542,
        -0.0475456602871418,
        0.04767093062400818,
        -0.043263282626867294,
        -0.0658213347196579,
        -0.06947237998247147,
        0.08507485687732697,
        -0.06034509092569351,
        0.002393470611423254,
        0.1801912635564804,
        -0.20098470151424408,
        0.05422235652804375,
        0.04179438576102257,
        -0.21415714919567108,
        0.054509926587343216,
        -0.1799883395433426,
        0.02714635245501995,
        -0.10580737143754959,
        0.11554010957479477,
        -0.13291838765144348,
        -0.03382664918899536,
        0.05258459225296974,
        0.12305808067321777,
        0.21657848358154297,
        0.2357860952615738,
        0.017819693312048912,
        0.1142229288816452,
        -0.14324964582920074,
        -0.12325345724821091,
        -0.1002722755074501,
        -0.02442600205540657,
        0.0187112707644701,
        0.01469754334539175,
        -0.04414690285921097,
        0.015367318876087666,
        -0.13731510937213898,
        0.2162596583366394,
        -0.159105584025383,
        0.11764808744192123,
        -0.13518908619880676,
        -0.0018431731732562184,
        0.07590177655220032,
        -0.17760737240314484,
        -0.0426119789481163,
        -0.07184488326311111,
        -0.050215572118759155,
        0.03875711187720299,
        -0.14539332687854767,
        -0.04701731353998184,
        0.15354400873184204,
        -0.14979012310504913,
        0.1119081899523735,
        0.017947498708963394,
        -0.009192284196615219,
        0.04477061703801155,
        0.1567586213350296,
        0.23254425823688507,
        0.1154710054397583,
        0.10759683698415756,
        0.05360257253050804,
        -0.16715054214000702,
        -0.05196576192975044,
        -0.04243110492825508,
        0.0927339494228363,
        0.1094871312379837,
        0.03306429833173752,
        0.2628966271877289,
        0.17701132595539093,
        0.14874213933944702,
        0.1617450714111328,
        -0.15838909149169922,
        -0.0719316378235817,
        -0.06986875832080841,
        0.028051450848579407,
        0.03532657027244568,
        -0.0879594087600708,
        -0.08327370136976242,
        -0.10718357563018799,
        0.17533406615257263,
        0.055808331817388535,
        -0.2798078656196594,
        0.06782912462949753,
        0.0773337334394455,
        -0.011521599255502224,
        0.12823854386806488,
        0.11800005286931992,
        -0.04640578478574753,
        -0.1590883582830429,
        0.06860105693340302,
        0.09875554591417313,
        0.04883963242173195,
        -0.017177043482661247,
        -0.06584781408309937,
        -0.04230985417962074,
        -0.12232441455125809,
        -0.16975583136081696,
        -0.10247660428285599,
        -0.040746353566646576,
        0.0724371001124382,
        -0.10749726742506027,
        -0.06323669105768204,
        0.00831356830894947,
        -0.13307702541351318,
        0.002789926016703248,
        -0.0438041016459465,
        0.010706505738198757,
        -0.06832985579967499,
        0.1124882772564888,
        -0.08961119502782822,
        0.004017326515167952,
        -0.18277499079704285,
        0.06835649907588959,
        -0.00962747447192669,
        -0.04135807603597641,
        0.025108758360147476,
        -0.22908928990364075,
        0.12050105631351471,
        -0.10246796905994415,
        -0.21445810794830322,
        0.013627830892801285,
        -0.059053923934698105,
        -0.014256962575018406,
        -0.10947781056165695,
        0.07322117686271667,
        -0.18710090219974518,
        0.07830037921667099,
        -0.2797742486000061,
        -0.09061465412378311,
        0.018389727920293808,
        -0.004132675472646952,
        -0.20148426294326782,
        0.06915159523487091,
        -0.14538462460041046,
        -0.10073333233594894,
        -0.034685827791690826,
        -0.016297947615385056,
        -0.1824619024991989,
        -0.07370465993881226,
        -0.016568152233958244,
        -0.2130282074213028,
        -0.18926359713077545,
        -0.017475847154855728,
        -0.2473759800195694,
        0.057014476507902145,
        -0.06372081488370895,
        0.18730755150318146,
        0.11362006515264511,
        -0.12957563996315002,
        0.18246428668498993,
        -0.1423640102148056,
        0.020936882123351097,
        -0.17213930189609528,
        0.1968422532081604,
        -0.03607562556862831,
        0.08452235162258148,
        0.12826523184776306,
        -0.019997723400592804,
        -0.1243036761879921,
        -0.20347057282924652,
        -0.15796369314193726,
        -0.028262345120310783,
        0.08840824663639069,
        -0.2177242636680603,
        0.13134972751140594,
        0.13687337934970856,
        0.011142673902213573,
        0.24417097866535187,
        0.08815022557973862,
        -0.24045820534229279,
        0.09933750331401825,
        -0.05500783398747444,
        0.019404524937272072,
        -0.034821223467588425,
        0.17692184448242188,
        -0.06907326728105545,
        -0.12430419772863388,
        -0.2067585587501526,
        -0.15821734070777893,
        -0.07151331752538681,
        -0.08095166832208633,
        -0.23598332703113556,
        -0.062064964324235916,
        0.04664304479956627,
        -0.0367576964199543,
        -0.03147955238819122,
        -0.012412602081894875,
        0.022297505289316177,
        0.020502839237451553,
        -0.15879787504673004,
        -0.15987393260002136,
        0.12783293426036835,
        0.0682692676782608,
        -0.03104964643716812,
        -0.19814205169677734,
        0.05131328105926514,
        0.035272516310214996,
        0.167963907122612,
        0.015851061791181564,
        0.1604246348142624,
        0.09084704518318176,
        0.08714334666728973,
        0.015644198283553123,
        0.08637140691280365,
        0.14924722909927368,
        -0.024048617109656334,
        -0.06858449429273605,
        -0.16762343049049377,
        0.02646390162408352,
        -0.015416181646287441,
        -0.049660131335258484,
        0.20806750655174255,
        -0.0305009912699461,
        -0.18359404802322388,
        -0.1567525714635849,
        0.12659801542758942,
        0.18032890558242798,
        0.09796643257141113,
        0.19077740609645844,
        -0.07138808816671371,
        -0.0375819057226181,
        -0.004899120423942804,
        -0.11569712311029434,
        0.11203659325838089,
        0.15527541935443878,
        -0.1368820071220398,
        0.21218986809253693,
        0.13341940939426422,
        0.022242680191993713,
        -0.08580787479877472,
        -0.27376794815063477,
        -0.16098511219024658,
        0.014465954154729843,
        0.10055142641067505,
        -0.2754662334918976,
        -0.27603915333747864,
        -0.15875934064388275,
        0.043131355196237564,
        0.0829419270157814,
        0.08638321608304977,
        0.02073313668370247,
        0.03473551198840141,
        -0.043498918414115906,
        -0.2728462517261505,
        -0.05212967097759247,
        0.07544178515672684,
        -0.18699264526367188,
        -0.07228140532970428,
        -0.006728518288582563,
        -0.016788002103567123,
        -0.03714825212955475,
        -0.18828611075878143,
        0.07434359937906265,
        0.0023098147939890623,
        0.033366527408361435,
        -0.13838748633861542,
        -0.26740095019340515,
        0.14594225585460663,
        -0.14391890168190002,
        -0.03915267810225487,
        -0.10281627625226974,
        -0.09886324405670166,
        -0.23090673983097076,
        0.20392853021621704,
        -0.021947810426354408,
        0.1330258548259735,
        0.02092520333826542,
        0.19040913879871368,
        -0.04842519760131836,
        0.1918807327747345,
        -0.10042435675859451,
        0.25402188301086426,
        -0.18598529696464539,
        0.07974336296319962,
        -0.04709027707576752,
        0.23511648178100586,
        -0.09143755584955215,
        0.04291307553648949,
        -0.11619381606578827,
        0.21666254103183746,
        -0.2725870907306671,
        -0.20224881172180176,
        -0.040813375264406204,
        -0.1260136365890503,
        -0.10756389051675797,
        0.059193629771471024,
        -0.028652533888816833,
        0.021110013127326965,
        -0.12560686469078064,
        -0.0295599065721035,
        -0.003219157224521041,
        0.15162348747253418,
        -0.0328579843044281,
        0.18420933187007904,
        0.022730080410838127,
        -0.034202851355075836,
        0.06179269030690193,
        0.18334291875362396,
        -0.17537079751491547,
        0.11475573480129242,
        0.0591890886425972,
        0.11604627221822739,
        -0.02980048768222332,
        -0.012321247719228268,
        -0.055001020431518555,
        0.10405822098255157,
        0.23402512073516846,
        0.04593748226761818,
        0.010058548301458359,
        0.13584227859973907,
        -0.12100730091333389,
        0.008647851645946503,
        0.18198363482952118,
        -0.053451187908649445,
        0.09281884878873825,
        0.19076988101005554,
        -0.08251003175973892,
        0.06275717914104462,
        0.00964287668466568,
        0.08509189635515213,
        -0.004948522429913282,
        0.10865329205989838,
        0.007201874163001776,
        -0.20399972796440125,
        -0.1875421702861786,
        0.1278333067893982,
        0.06043710932135582,
        -0.2923996150493622,
        0.1967770904302597,
        -0.00891787651926279,
        -0.029901985079050064,
        -0.15971359610557556,
        0.10792765766382217,
        0.2028982788324356,
        0.14729827642440796,
        -0.02335561439394951,
        -0.19406181573867798,
        -0.05815467610955238,
        -0.023409366607666016,
        -0.09707438200712204,
        -0.008734679780900478,
        -0.08299897611141205,
        0.013986225239932537,
        0.12643945217132568,
        0.17357608675956726,
        -0.18281960487365723,
        -0.013667723163962364,
        -0.08932061493396759,
        -0.11731025576591492,
        -0.09109808504581451,
        0.09834588319063187,
        -0.13654287159442902,
        0.09283222258090973,
        -0.07667690515518188,
        -0.28605663776397705,
        -0.03470522537827492,
        -0.1268741637468338,
        0.25911128520965576,
        0.013361881487071514,
        -0.11633486300706863,
        -0.05754408240318298,
        -0.23953740298748016,
        -0.05511457100510597,
        -0.13297896087169647,
        0.09004820138216019,
        0.1467922478914261,
        0.06034150719642639,
        -0.1900920569896698,
        0.005838541779667139,
        -0.08897529542446136,
        -0.07069708406925201,
        -0.08826253563165665,
        0.04669280722737312,
        0.04751599207520485,
        -0.2728082537651062,
        0.0461043156683445,
        -0.052007704973220825,
        -0.008971866220235825,
        -0.08444445580244064,
        -0.09862569719552994,
        -0.05594980716705322,
        -0.08214184641838074,
        0.042694322764873505,
        -0.2601625323295593,
        0.17743954062461853,
        -0.271544873714447,
        0.07584646344184875,
        -0.032431136816740036,
        0.051905013620853424,
        0.1320018172264099,
        0.14801573753356934,
        -0.1176425889134407,
        -0.08900703489780426,
        0.17648819088935852,
        0.004636222496628761,
        0.10217731446027756,
        -0.0698859691619873,
        0.05960956588387489,
        0.07800043374300003,
        -0.055400311946868896,
        0.09665323793888092,
        -0.07600998878479004,
        0.0740431621670723,
        0.19869063794612885,
        -0.2125045657157898,
        -0.0825793519616127,
        -0.17966611683368683,
        0.044613417237997055,
        0.1300377994775772,
        0.06603752076625824,
        0.20393934845924377,
        0.17675812542438507,
        -0.07284998148679733,
        0.02624822035431862,
        0.0057159713469445705,
        -0.09136122465133667,
        -0.0356501042842865,
        0.00634266110137105,
        -0.03964395821094513,
        -0.11230882257223129,
        -0.06734484434127808,
        -0.09442124515771866,
        0.02704584039747715,
        -0.22235068678855896,
        -0.09526316076517105,
        0.15565375983715057,
        0.06188606470823288,
        -0.0264926515519619,
        -0.0856868252158165,
